[
    {
        "title": ["Missing Cookie Security Attribute - Secure","h1"],
        "description": ["The secure flag is an option that can be set by the application server when sending a new cookie to the user within an HTTP Response. The purpose of the secure flag is to prevent cookies from being observed by unauthorized parties due to the transmission of the cookie in clear text.","p"],
        "impact": ["An attacker that intercepts the request can be able to view the cookie session id in clear text, and use it to impersonate that user on further communications with the application.","p"],
        "remediation": ["By setting the secure flag, the browser will prevent the transmission of acookie over an unencrypted channel.","p"],
        "cvss_vector": ["CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:L/A:N","a"],
        "other_refs": ["https://cwe.mitre.org/data/definitions/614","a"],
        "technical_details": ["The application does not properly protect session cookies. In the case of domain, one of the session cookies are being set, without the proper protection attributes and both with the same value (See figure 1). See appendix C for more information.","div"],
        "current_status": ["At the current report date, this issue has not been fixed (see Figure 2).","p"]
    },
    {
        "title": ["Missing Cookie Security Attribute - HttpOnly","h1"],
        "description": ["Using the HttpOnly flag when generating a cookie helps mitigate the risk of client side scripts accessing the protected cookie (if the browser supports it).","p"],
        "impact": ["An attacker that discovers a XSS flaw on the website, can manage to steal user cookies, because client side scripts are able to access cookies.","p"],
        "remediation": ["By setting the HttpOnly flag, the browser won’t let client side scripts access client cookies (only if the browser supports this flag, otherwise it will ignore the flag).","p"],
        "cvss_vector": ["CVSS:3.0/AV:N/AC:H/PR:L/UI:R/S:C/C:H/I:L/A:N","a"],
        "other_refs": ["https://cwe.mitre.org/data/definitions/1004","a"],
        "technical_details": ["The application does not properly protect session cookies. In the case of domain, one of the session cookies are being set, without the proper protection attributes and both with the same value (See figure 1). See appendix C for more information.","div"],
        "current_status": ["At the current report date, this issue has not been fixed (see Figure 2).","p"]
    }
]